[
    {
        "id": 1,
        "label": "Open when you miss me",
        "emoji": "💕",
        "color": "#ff6b9d",
        "content": "My love,\n\nI know the distance feels heavy right now. Close your eyes and remember that I'm thinking about you too, at this exact moment. We're looking at the same moon, under the same sky.\n\nEvery kilometer between us is just proof of how strong our love is. You're worth every second of waiting.\n\nI miss you more than words can say.\n\nForever yours,\n[Your Name]"
    },
    {
        "id": 2,
        "label": "Open when you're sad",
        "emoji": "🤗",
        "color": "#a855f7",
        "content": "Hey beautiful,\n\nI wish I could be there to hold you right now. But since I can't, let me remind you:\n\nYou are stronger than you know. You are loved more than you realize. And whatever is making you sad right now? It's temporary.\n\nYou've got this. And you've got me.\n\nTake a deep breath. Everything will be okay.\n\nLove you always,\n[Your Name]"
    },
    {
        "id": 3,
        "label": "Open when you can't sleep",
        "emoji": "🌙",
        "color": "#3b82f6",
        "content": "Can't sleep, my love?\n\nImagine I'm right there with you. We're cuddled up, I'm playing with your hair, telling you about my day.\n\nYou're safe. You're loved. Tomorrow is a new day full of possibilities.\n\nNow close your eyes and dream of us.\n\nSweet dreams, my forever person.\n\n[Your Name]"
    },
    {
        "id": 4,
        "label": "Open when you need a smile",
        "emoji": "😊",
        "color": "#22c55e",
        "content": "QUICK!\n\nRemember that embarrassing thing I did that made you laugh so hard? Yeah, think about that.\n\nOr remember how bad I am at cooking? Or that time I... [add your own inside joke here].\n\nIs it working? Are you smiling yet?\n\nI love making you laugh. Your smile is everything.\n\n❤️ [Your Name]"
    },
    {
        "id": 5,
        "label": "Open on Valentine's Day",
        "emoji": "💝",
        "color": "#ec4899",
        "content": "Happy Valentine's Day, my love!\n\nAnother Valentine's Day where I wish I could be holding your hand. But here we are, proving that love isn't about being in the same place – it's about choosing each other, every single day.\n\nI choose you today. I'll choose you tomorrow. And I'll keep choosing you forever.\n\nThank you for being my person.\n\nI love you to the moon and back.\n\nYours forever,\n[Your Name]"
    }
]